import {Component} from '@angular/core';

interface Item {
    question: string;
    answer: string;
    isOpen?: boolean;
}

@Component({
    selector: 'app-faq',
    templateUrl: './faq.component.html',
    styleUrls: ['./faq.component.scss'],
})
export class FaqComponent {
    public items: Item[] = [
        {
            question: 'آیا می‌توانم این دوره را به عنوان کارآموزی دانشگاه بگذرانم؟',
            answer: `
                بله! ولی همان طور که در قسمت‌های قبلی توضیح داده شد،
                دوره به صورت مرحله‌ای برگزار می‌شود و برای رد شدن از هر مرحله،
                نیاز است تا امتیاز مورد نظر را کسب کنید؛
                بنابراین امتیازی که در هر مرحله کسب می‌کنید،
                به طوری مستقیم بر روی نمره‌ای که برای کارآموزی دانشگاه شما ثبت می‌شود، تاثیرگذار است.
            `,
        },
        {
            question: 'آیا محتوای دوره به صورت یک‌جا در اختیارم قرار می‌گیرد؟',
            answer: `
                محتوای دوره از همان ابتدا در اختیار تمام کارآموزان قرار می‌گیرد ولی برای گذراندن هر مرحله،
                برنامه‌ای فشرده داریم و معمولاً کارآموزان با سرعتی که ما پیش‌بینی می‌کنیم دوره را می‌گذرانند.
                البته برای عزیزانی که زودتر از موعد مقرر به هدف یک مرحله برسند، محتوای جانبی و امتیازی قرار
                داده‌ایم تا مطمئن شویم تمام کارآموزان از وقت خود نهایت استفاده را می‌برند.
            `,
        },
    ];

    public questionClickHandler(index: number): void {
        this.items[index].isOpen = !this.items[index].isOpen;
    }
}
